
{
  "welcomeTitle": "Welcome to Aksharajanani!",
  "welcomeContent": "This tutorial will guide you through the process of drawing, testing, and refining your font.",
  "clickFirstChar": "Let's start by creating your first letter. Click the 'A' card.",
  "splitViewIntro": "This is the split view. You can **drag this divider** to resize the panels. The grid also serves as a **quick navigator** to jump between characters.",
  "toolbarPenContent": "This is the Pen tool. It is selected by default. You can use it to draw freehand shapes.",
  "drawContent": "Draw the shape of 'A' on this canvas. Take your time! The tutorial will wait for you. When you are finished drawing, click 'Next'.",
  "clickNextForA": "Good start! Click the Next arrow to continue to the letter 'a'.",
  "drawLowerA": "Now, try drawing the lowercase 'a'.",
  "toolbarIntro": "This is the **Toolbar**. It contains freehand tools, precise shape tools, and action buttons.",
  "toolbarActionsIntro": "Great! The toolbar also has actions like Select, Pan, Undo, and Copy. Let's take a quick tour.",
  "toolSelect": "The **Select Tool** lets you click, move, resize, and rotate your shapes.",
  "toolPan": "Use the **Pan Tool** to click and drag your view around the canvas without moving your shapes.",
  "toolCalligraphy": "The **Calligraphy Pen** creates strokes with variable thickness, like a broad-nib pen. You can change the nib angle by clicking the tool icon again.",
  "toolEraser": "The **Eraser Tool** splits a path where you drag over it. It's great for creating gaps.",
  "toolSlice": "The **Slice Tool** cuts through a shape with a straight line, splitting it into two separate paths.",
  "actionUndo": "Made a mistake? **Undo** reverses your last action.",
  "actionRedo": "Changed your mind? **Redo** brings it back.",
  "actionCut": "Select a shape and click **Cut** to remove it and place it on your clipboard.",
  "actionCopy": "**Copy** places the selected shape on your clipboard without removing it.",
  "actionPaste": "**Paste** inserts the shape from your clipboard onto the canvas.",
  "actionGroup": "If you have multiple shapes selected, **Group** them to treat them as a single object.",
  "actionUngroup": "Select a group and click **Ungroup** to separate them back into individual shapes.",
  "clickNextForT": "You've seen the main tools. Click Next to continue to 'T'.",
  "selectLineTool": "The toolbar has **Shape Tools** for precise forms like lines, curves, and circles. Select the **Line Tool** now, then click 'Next'.",
  "drawT": "Use the Line Tool to construct the letter 'T' with two straight lines.",
  "explainBearings": "These yellow dashed lines are the **Side Bearing** guides. They control the spacing around your character.",
  "dragLSB": "Try dragging the **LSB (Left Side Bearing)** line to change the space on the left side of your 'T'. Then click Next.",
  "dragRSB": "Good. Now adjust the **RSB (Right Side Bearing)** line. This spacing is crucial for how letters fit together. When you're done, click Next.",
  "clickBackToDashboard": "Click Back to return to the dashboard.",
  "clickAAgain": "Select 'A' again to return to the editor.",
  "openGrid": "On smaller screens, click the floating **Grid button** to open the character list.",
  "clickTest": "Great work! Now, let's see how it looks. Click the Test (flask) button.",
  "testPageInput": "This is the Test Page. You can type here to test how your font renders text.",
  "closeTestPage": "Click the Back button to close the test page.",
  "selectCharF": "Now, select 'F' from the grid.",
  "drawCharF": "Draw the shape of 'F'. This is important because the next letter, 'E', uses this shape as a starting point.",
  "clickNextForComposite": "Let's see a powerful feature. Click Next to go to 'E'.",
  "compositeExplanation": "This is 'E'. It has been **pre-filled** with the shape of 'F'. You can now add strokes to finish the letter. Unlike linked glyphs, changes here are independent and won't affect the original 'F'.",
  "drawComposite": "Now, draw the bottom stroke to complete the 'E'. Notice how your new stroke combines with the pre-filled 'F' shape.",
  "clickNextForLowerE": "Let's create a lowercase 'e'. Click the Next Glyph arrow.",
  "drawLowerE": "Draw a simple 'e' on the canvas.",
  "clickNextForLinked": "Click Next again to see the magic of Linked Glyphs.",
  "linkedExplanation": "This is a combining mark. Notice it is already drawn! It is a **Linked Glyph** derived directly from the 'e' you just drew, scaled down automatically.",
  "linkedStripNav": "You can also navigate quickly between the Linked Glyph and its source components using this strip at the bottom.",
  "transformLinked": "Linked glyphs track the source shape, but their **position and size** are editable! Select the shape and try scaling or rotating it.",
  "clickPrevForModification": "Now, let's change the source. Click the **Previous Glyph** arrow to go back to 'e'.",
  "modifyLowerE": "Modify the 'e' significantly (e.g. add a circle around it).",
  "clickNextToVerify": "Go back to the linked glyph (Next).",
  "verifyLink": "See? the linked glyph updated automatically to match your changes!",
  "explainBack": "Now, click **Back** to return to the Character Grid so we can explore the final tools.",
  "explainCreator": "Open the **Creator Studio** to create artwork, stickers, and social media posts using your font.",
  "explainCompare": "Use **Compare** to view multiple characters side-by-side. Useful for checking consistency.",
  "explainSettings": "Adjust global font settings, metadata (like designer name), and view metrics here.",
  "explainExport": "When you are ready, click **Export** to generate and download your installable OpenType (.otf) font file.",
  "positioningNav": "Finally, let's explore the powerful **Positioning** workspace. This is where you align marks, like accents or vowel signs, to base letters. Click the **Positioning** tab to continue.",
  "positioningIntro": "This is the Positioning Workspace. Here you'll align marks (like accents or vowel signs) to base letters and accept or adjust the app's automatic suggestions.",
  "positioningViews": "You can browse pairs in three ways: **By Rule** (groups similar pairs), **By Base** (shows all marks for a single base), or **By Mark** (shows a single mark on all bases).",
  "positioningPreviewCard": "This card shows a preview of the automatically positioned pair. The dashed border means it's an unconfirmed suggestion.",
  "startPositioning": "Click 'Start Positioning' to review the pairs in this rule.",
  "positioningAccept": "To accept the automatic position for **Aͤ**, click the **Checkmark** button.",
  "positioningEdit": "Great! Now, let's fix one that might be incorrect. To make a manual adjustment, click on the **Eͤ** card to open the detailed editor.",
  "positioningEditor": "In this view, you can **drag the mark** into the perfect position. When you're satisfied with the alignment, click **Save** in the header. For now, just click 'Next' to finish the tour.",
  "finish": "You are ready to create! Explore the other workspaces for Positioning and Kerning when you are done drawing.",
  "last": "Finish Tour",
  "skip": "Skip Tutorial",
  "next": "Next",
  "back": "Back",
  "ok": "OK",
  "close": "Close",
  "finishBtn": "Finish",
  "dontShowAgain": "Don't show me this again",
  "hintGridSelect": "Welcome! Select a character card to start drawing your font.",
  "hintEditorDraw": "The **Pen Tool** is active. Click and drag on the canvas to draw your character shape.",
  "hintRelatedPairsTitle": "Smart Positioning",
  "hintRelatedPairsContent": "This pair belongs to a **Smart Class**. Any position changes you make here will automatically sync to all **Related Pairs** shown in this strip.",
  "hintOverrideTitle": "Creating Exceptions",
  "hintOverrideContent": "Need a unique position for this specific pair? Click this button to **Unlink**. This creates an **Override**, allowing you to move this mark independently without affecting the rest of the class.",
  "hintCompositeTitle": "Composite Glyph",
  "hintCompositeContent": "This glyph is constructed from components. It has been pre-filled for you. You can edit the paths, or use the <strong>Refresh</strong> button to update it if the source components change.",
  "hintLinkedTitle": "Linked Glyph",
  "hintLinkedContent": "This is a <strong>Linked Glyph</strong>. Its shape is automatically constructed from other characters (e.g. Base + Mark). It updates live when the source characters change.",
  "hintUnlinkContent": "To edit the shape manually, you must **Unlink** it first. This breaks the connection to the source components and converts it to a standard glyph.",
  "hintRelinkContent": "You have unlinked this glyph. It is now independent. If you want to revert to the automatic shape, click the **Relink** button here. Note: This will discard your manual edits.",
  "hintPositionedTitle": "Positioned Pair",
  "hintPositionedContent": "This is a <strong>Positioned Pair</strong>. It is dynamically generated by placing a Mark relative to a Base character. You can adjust the position coordinates here.",
  "hintDetachContent": "Need to edit the shape itself? Click **Detach** to convert this live pair into an **Independent Glyph**. You can then edit the shape manually.",
  "hintAcceptPosition": "Looks good? Clicking **Accept** will save this default calculated position as correct.",
  "hintKernedTitle": "Kerned Pair",
  "hintKernedContent": "This is a <strong>Kerned Pair</strong>. It represents a specific spacing adjustment between two characters.",
  "hintAcceptKerning": "Looks good? Clicking **Accept** will save this default calculated spacing as correct.",
  "hintKerningWorkspaceTitle": "Spacing & Kerning",
  "hintKerningWorkspaceContent": "This is where character pairs can be adjusted to have custom spacing.",
  "hintPositioningWorkspaceTitle": "Positioning & Alignment",
  "hintPositioningWorkspaceContent": "This is where characters are positioned to create perfect alignment.",
  "clickNextForN": "Let's see how **Smart Positioning** works. Click Next to go to 'n'.",
  "drawN": "Draw the base letter 'n'.",
  "clickNextForTilde": "Now for the first mark. Click Next for the tilde (~).",
  "drawTilde": "Draw the tilde mark. It's a non-spacing mark, so it will automatically be positioned above letters.",
  "clickNextForMacron": "Let's add another mark to see how they sync. Click Next for the macron (¯).",
  "drawMacron": "Draw the macron mark.",
  "clickNextForNTilde": "Ready? Click Next to see 'ñ', which is automatically composed from 'n' and '~'.",
  "positioningConcept": "This is 'ñ'. The app automatically combined 'n' + '~' for you! This position is just a suggestion that you can change.",
  "positioningStripIntro": "This is the **Related Pairs** strip. It shows all characters in the same **Smart Class**. Changes you make to 'ñ' will automatically sync to 'n̄'.",
  "positioningDrag": "Now, try it! **Click and drag the tilde** to a new position. See how the 'n̄' thumbnail updates live? When you're done, click Next.",
  "positioningStripNavToNBar": "To verify the change, click on the **'n̄' thumbnail** in the strip to navigate directly to it.",
  "smartClassExpl": "Perfect! The position you set for the tilde on 'ñ' has been automatically applied to the macron on 'n̄'. This saves a lot of time!",
  "positioningTryDragLocked": "Now, try dragging the macron on `n̄` yourself.",
  "positioningExplainLock": "You'll notice it doesn't move. This is because it's part of a **Smart Class** and its position is synced to the `ñ` you edited earlier. To give this pair a unique position, you need to create an **Override**.",
  "positioningClickUnlink": "Click the **Synced** button in the control panel to unlink this pair from its class. **Then, click Next.**",
  "positioningConfirmOverride": "Excellent! This pair is now an **Override** and will no longer receive automatic updates from `ñ`. Notice the icon has changed.",
  "positioningDragOverride": "Now, **drag the macron again**. See? It moves freely. When you're ready, click Next.",
  "positioningOverrideFinish": "You've successfully created an exception. This powerful feature allows you to maintain consistency across a class while still handling special cases that require unique alignment.",
  "threePillarsIntro": "You've mastered drawing! The next two workspaces, **Positioning** and **Kerning**, are the final pillars of font design. **Positioning** handles vertical alignment (like accents), while **Kerning** handles horizontal spacing between letters.",
  "kerningNav": "Let's explore the final pillar: **Kerning**. This controls the horizontal space between specific pairs of letters (like 'Te' or 'Av'). Click the **Spacing/Kerning** tab.",
  "kerningIntroAndViews": "This is the Spacing & Kerning Workspace. You can browse pairs in three ways: **Suggestions** (pairs the app recommends fixing), **Spaced** (pairs you have already adjusted), and **All Pairs** (a tool to create any pair you want).",
  "kerningManualEdit": "Let's fix one manually. Click the **Te** card to open the editor.",
  "kerningEditor": "In the editor, **drag the right character** to adjust the space.",
  "kerningClickBack": "Great! The spacing is saved. Now click **Back** to return to the list.",
  "kerningSpacedTab": "Great! The 'Te' pair you just adjusted now appears in the **Spaced** tab. This is where you can review all of your completed work. Click 'Next' to continue.",
  "kerningAutoTools": "**Auto-Kern** fixes all pairs in the Suggestions list at once using visual logic. **Detect New Pairs** scans your font for other potential problem spots and adds them here for review.",
  "kerningAllPairsTab": "Finally, if you need to adjust a pair that wasn't suggested, use the **All Pairs** tab. You can select characters from the side panels to generate and edit any custom pair you want.",
  "finalCongratulations": "**Congratulations! You're a Font Designer.** You've completed the full workflow: from **Drawing** shapes, to **Positioning** marks and **Kerning** pairs. Your font is now ready for final testing and exporting. Happy creating!",
  "compositeTools": "Made a mistake? Use **Reset** to revert to the original template. If the source glyph (F) changes later, use **Refresh** to update this composite.",
  "unlinkExpl": "This glyph is locked to 'e'. To edit its shape manually (e.g., to make it wider), click the **Unlink** button.",
  "relinkExpl": "Now it is an independent shape. To restore the live link to 'e' and discard your manual changes, click **Relink**.",
  "detachExpl": "This pair is generated by math (Positioning). If you need to edit the *shape* of the mark specifically for this base (e.g., to squash it), click **Detach**. This converts it into a manual Composite glyph."
}
