{
  "welcomeTitle": "Welcome to Aksharajanani!",
  "welcomeContent": "This tutorial will guide you through the process of drawing, testing, and refining your font.",
  "clickFirstChar": "Let's start by creating your first letter. Click the 'A' card.",
  "toolbarPenContent": "This is the Pen tool. It is selected by default. You can use it to draw freehand shapes.",
  "drawContent": "Draw the shape of 'A' on this canvas. Take your time! The tutorial will wait for you. When you are finished drawing, click 'Next'.",
  "clickBackToDashboard": "Click Back to return to the dashboard.",
  "clickAAgain": "Select 'A' again to return to the editor.",
  "openGrid": "Open the Character Grid.",
  "clickTest": "Great work! Now, let's see how it looks. Click the Test (flask) button.",
  "testPageInput": "This is the Test Page. You can type here to test how your font renders text.",
  "closeTestPage": "Click the Back button to close the test page.",
  
  "clickNextForLowerA": "Let's draw the lowercase 'a'. Click the Next Glyph arrow.",
  "drawLowerA": "Draw the 'a'. Notice how the curves work.",
  
  "clickNextForT": "Now let's draw 'T'. Click Next.",
  "drawT": "Draw the 'T'. Use straight lines.",
  
  "clickNextForF": "Click Next to go to 'F'.",
  "drawCharF": "Draw the shape of 'F'. This is important because the next letter, 'E', uses this shape as a starting point.",
  
  "toolSelectPan": "The **Select Tool** is used to move, rotate, and scale paths. The **Pan Tool** is used to move the canvas view.",
  "toolEraser": "The **Eraser** removes parts of your drawing, and the **Slice Tool** cuts shapes into pieces.",
  "actionUndo": "Made a mistake? Use Undo/Redo or Copy/Paste.",
  "actionGroup": "Use Group to combine paths into a single object for easier moving.",
  
  "clickNextForComposite": "Let's see a powerful feature. Click Next to go to 'E'.",
  "compositeExplanation": "This is 'E'. It has been **pre-filled** with the shape of 'F'. You can now add strokes to finish the letter. Unlike linked glyphs, changes here are independent and won't affect the original 'F'.",
  "drawComposite": "Now, draw the bottom stroke to complete the 'E'. Notice how your new stroke combines with the pre-filled 'F' shape.",
  
  "clickNextForLowerE": "Let's create a lowercase 'e'. Click the Next Glyph arrow.",
  "drawLowerE": "Draw a simple 'e' on the canvas.",
  "clickNextForLinked": "Click Next again to see the magic of Linked Glyphs.",
  "linkedExplanation": "This is a combining mark. Notice it is already drawn! It is a **Linked Glyph** derived directly from the 'e' you just drew, scaled down automatically.",
  "linkedStripNav": "You can also navigate quickly between the Linked Glyph and its source components using this strip at the bottom.",
  "transformLinked": "Linked glyphs track the source shape, but their **position and size** are editable! Select the shape and try scaling or rotating it.",
  "clickPrevForModification": "Now, let's change the source. Click the **Previous Glyph** arrow to go back to 'e'.",
  "modifyLowerE": "Modify the 'e' significantly (e.g. add a circle around it).",
  "clickNextToVerify": "Go back to the linked glyph (Next).",
  "verifyLink": "See? The linked glyph updated automatically to match your changes!",

  "clickNextForN": "Let's explore **Smart Positioning**. Click Next to go to 'n'.",
  "drawN": "Draw the base letter 'n'.",
  "clickNextForTilde": "Click Next to go to the Tilde mark.",
  "drawTilde": "Draw the Tilde (~).",
  "clickNextForMacron": "Click Next to go to the Macron.",
  "drawMacron": "Draw the Macron (¯). We need two marks to demonstrate how they sync.",
  "clickNextForNTilde": "Click Next to go to 'ñ'.",
  "positioningIntro": "This is the **Positioning Editor**. Drag the Tilde on the canvas to place it correctly above the 'n'.",
  "smartClassExpl": "Look at the bottom strip. It shows **Related Pairs**. Tilde and Macron are in the same **Smart Class**, so positioning one updates the other automatically!",
  "unlinkExpl": "Need this specific pair to be different? Click **Unlink** to move this mark independently without affecting the Macron.",
  "detachExpl": "If you need to change the *shape* of the mark just for this letter (e.g. to squash it), click **Detach** to bake it into a new composite glyph.",
  
  "explainCreator": "Open the **Creator Studio** to create artwork, stickers, and social media posts using your font.",
  "explainCompare": "Use **Compare** to view multiple characters side-by-side. Useful for checking consistency.",
  "explainSettings": "Adjust global font settings, metadata (like designer name), and view metrics here.",
  "explainExport": "When you are ready, click **Export** to generate and download your installable OpenType (.otf) font file.",
  "explainBack": "Now, click **Back** to return to the Character Grid so we can explore the final tools.",

  "finish": "You are ready to create! Explore the other workspaces for Positioning and Kerning when you are done drawing.",
  "last": "Finish Tour",
  "skip": "Skip Tutorial",
  "next": "Next",
  "back": "Back",
  "ok": "OK",
  "close": "Close",
  "finishBtn": "Finish",
  "dontShowAgain": "Don't show me this again",

  "hintGridSelect": "Welcome! Select a character card to start drawing your font.",
  "hintEditorDraw": "The **Pen Tool** is active. Click and drag on the canvas to draw your character shape.",
  "hintRelatedPairsTitle": "Smart Positioning",
  "hintRelatedPairsContent": "This pair belongs to a **Smart Class**. Any position changes you make here will automatically sync to all **Related Pairs** shown in this strip.",
  "hintOverrideTitle": "Creating Exceptions",
  "hintOverrideContent": "Need a unique position for this specific pair? Click this button to **Unlink**. This creates an **Override**, allowing you to move this mark independently without affecting the rest of the class.",
  
  "hintCompositeTitle": "Composite Glyph",
  "hintCompositeContent": "This glyph is constructed from components. It has been pre-filled for you. You can edit the paths, or use the <strong>Refresh</strong> button to update it if the source components change.",
  "hintLinkedTitle": "Linked Glyph",
  "hintLinkedContent": "This is a <strong>Linked Glyph</strong>. Its shape is automatically constructed from other characters (e.g. Base + Mark). It updates live when the source characters change.",
  "hintUnlinkContent": "To edit the shape manually, you must **Unlink** it first. This breaks the connection to the source components and converts it to a standard glyph.",
  "hintRelinkContent": "You have unlinked this glyph. It is now independent. If you want to revert to the automatic shape, click the **Relink** button here. Note: This will discard your manual edits.",
  "hintPositionedTitle": "Positioned Pair",
  "hintPositionedContent": "This is a <strong>Positioned Pair</strong>. It is dynamically generated by placing a Mark relative to a Base character. You can adjust the position coordinates here.",
  "hintDetachContent": "Need to edit the shape itself? Click **Detach** to convert this live pair into an **Independent Glyph**. You can then edit the shape manually.",
  "hintAcceptPosition": "Looks good? Clicking **Accept** will save this default calculated position as correct.",
  "hintKernedTitle": "Kerned Pair",
  "hintKernedContent": "This is a <strong>Kerned Pair</strong>. It represents a specific spacing adjustment between two characters.",
  "hintAcceptKerning": "Looks good? Clicking **Accept** will save this default calculated spacing as correct.",
  "hintKerningWorkspaceTitle": "Spacing & Kerning",
  "hintKerningWorkspaceContent": "This is where character pairs can be adjusted to have custom spacing.",
  "hintPositioningWorkspaceTitle": "Positioning & Alignment",
  "hintPositioningWorkspaceContent": "This is where characters are positioned to create perfect alignment."
}