{
  "helpTitle": "User Guide",
  "helpQuickStartTitle": "Quick Start: Your First Glyph",
  "helpQuickStartContent": "Follow these steps to create a working font in minutes:\n\n* **1. Pick a Script:** Select your language from the home screen.\n* **2. The Drawing Grid:** Click any character in the grid to open the **Drawing Editor**.\n* **3. Draw Your Shape:** Use the **Pen** for smooth curves or the **Calligraphy** tool for a traditional look.\n* **4. Positioning:** If your script has vowel signs, go to the **Positioning** workspace to align marks with base characters.\n* **5. Import Existing Work:** Use the **Import from Project** feature in the 'More' menu to merge glyphs from other projects or local files.\n* **6. Test & Export:** Click the **Test** (flask) icon to type with your font instantly. When ready, click **Export Font** to download your OTF file.",
  "helpDrawingTitle": "Drawing Workspace",
  "helpDrawingContent": "The Drawing workspace is where you design your character outlines. \n\n**1. Glyph Construction & Linking:**\n* **Linked Glyphs (Live):** These characters combine other glyphs (e.g., `k` + `i`). They update automatically whenever you change the source shapes. Use the **Unlink** (broken chain) button to convert them to normal editable paths.\n* **Composite Glyphs (Template):** These are pre-filled with shapes once upon creation but are fully editable.\n\n**2. Professional Drawing Tools:**\n* **Slice Tool:** Cut through any path to split it into two independent segments. Simply drag a line across the shape you wish to cut.\n* **Calligraphy Pen:** Simulates a broad-nib pen. Click the tool icon again to cycle through 45°, 30°, and 15° angles.\n* **Edit Points:** Reveals anchor points and control handles. Double-click a line to add a point; double-click a point to delete it.\n\n**3. Batch Operations (Batch Mode):**\n* Click the **Select** (stack) icon in the grid sub-header to enter **Batch Mode**. \n* Select multiple glyphs to apply **Bulk Transformations** (Rotate, Scale, Flip) or to edit **Metrics** (LSB/RSB) for many characters at once. A convenient action bar will appear at the top/bottom of the grid.",
  "helpPositioningTitle": "Positioning & Smart Classes",
  "helpPositioningContent": "This workspace handles how marks (like vowel signs or dots) attach to base consonants.\n\n* **View Modes:** Toggle between **By Rule** (logical groups), **By Base**, or **By Mark**.\n* **Class Synchronization:** Characters are often grouped into **Attachment Classes**. Positioning a mark on a 'Class Representative' (marked with a crown) will automatically propagate that position to all 'Siblings' in the class. \n* **Unlinking:** If a specific combination needs a unique position that differs from its class, click the **Broken Link** icon in the editor to break the sync.",
  "helpRulesTitle": "Advanced Rules & Manual FEA",
  "helpRulesContent": "The **Rules** workspace provides granular control over the font's internal logic.\n\n* **GUI Rule Editor:** Visually define **Ligatures**, **Contextual Substitutions**, and **Lookups**. Use the 'Lookups' sub-tab to create reusable logical blocks and the 'Groups' sub-tab to define custom glyph classes (starting with `@`).\n* **Manual FEA Editor:** For power users, the **Edit Manually** mode allows you to write raw OpenType Feature (FEA) code. **Warning:** Enabling this mode disables the GUI editor to prevent data conflicts. You can revert to the GUI, but manual code changes will be discarded.\n* **Exporting Logic:** You can export your rules as a standard `.fea` file or a project-specific `.json` rules file.",
  "helpKerningTitle": "Kerning (Spacing)",
  "helpKerningContent": "Kerning adjusts the horizontal gap between specific pairs of letters for visual balance.\n\n* **Auto-Kern:** Use the **Sparkles** icon to let the engine calculate optical spacing automatically based on the glyph shapes.\n* **X-Distance:** In the editor, hover over the gap to see the 'x-dist' line. This represents the closest distance between glyphs in their middle zone. Input a target value to snap the spacing precisely.",
  "helpCreatorTitle": "Creator Studio",
  "helpCreatorContent": "Use the purple **Create** button to turn your font into artwork or stickers.\n\n* **Layouts:** Presets for Square (Social Posts), Portrait (Stories), and Landscape.\n* **Customization:** Drag text directly on the canvas to position it. Add background images, adjust shadows, and use the 'Dimmer' overlay for better readability.\n* **Export:** Download your creation as a high-resolution PNG.",
  "helpSettingsTitle": "Settings & Version History",
  "helpSettingsContent": "* **Metrics:** Adjust global font properties like UPM, Ascender, and Descender using the visual visualizer.\n* **Guide Font:** Upload a reference font (.ttf) to see its ghost outline in the background while you design.\n* **Snapshots (Version History):** The app automatically saves your progress to a local database. Use **Take Snapshot** in the 'More' menu to manually save a specific state. \n* **Snapshot Limits:** A maximum of **5 snapshots** are kept per project. Creating a 6th will automatically remove the oldest one. Snapshots are stored locally in your browser and are not included in the project `.json` file unless manually exported.",
  "helpSupportedScriptsTitle": "Supported Scripts"
}