{
  "helpTitle": "User Guide",
  "helpQuickStartTitle": "Quick Start: Your First Glyph",
  "helpQuickStartContent": "Follow these steps to create a working font in minutes:\n\n* **1. Pick a Script:** Select your language from the home screen.\n* **2. The Drawing Grid:** Click any character in the grid to open the **Drawing Editor**.\n* **3. Draw Your Shape:** Use the **Pen** for smooth curves or the **Calligraphy** tool for a traditional look.\n* **4. Positioning:** If your script has vowel signs, go to the **Positioning** workspace to align marks with base characters. Aligning one 'Leader' automatically updates its siblings.\n* **5. Test & Export:** Click the **Test** (flask) icon to type with your font instantly. When ready, click **Export Font** to download your OTF file.",
  "helpDrawingTitle": "Drawing Workspace",
  "helpDrawingContent": "The Drawing workspace is where you design your character outlines. \n\n**1. Glyph Construction & Linking:**\n* **Linked Glyphs (Live):** These characters combine other glyphs (e.g., `k` + `i`). They update automatically whenever you change the source shapes. Use the **Unlink** (broken chain) button to convert them to normal editable paths.\n* **Composite Glyphs (Template):** These are pre-filled with shapes once upon creation but are fully editable. \n* **Refreshing:** Click the **Refresh** (circular arrow) icon to re-generate a Linked or Composite glyph from its original components.\n\n**2. Professional Drawing Tools:**\n* **Slice Tool:** Cut through any path to split it into two independent segments. Simply drag a line across the shape you wish to cut.\n* **Calligraphy Pen:** Simulates a broad-nib pen. Click the tool icon again to cycle through 45°, 30°, and 15° angles.\n* **Edit Points:** Revels red anchor points and yellow control handles. Double-click a line to add a point; double-click a point to delete it.\n* **Contextual Toolbar:** When paths are selected, a floating bar appears for precise numeric Rotation, Scale, and Flipping.\n\n**3. Batch Operations:**\n* Click the **Select** (stack) icon in the grid to select multiple glyphs. Use the resulting action bar to apply bulk transformations (Rotate, Scale, Flip) or to edit LSB/RSB metrics for many characters at once.",
  "helpPositioningTitle": "Positioning & Smart Classes",
  "helpPositioningContent": "This workspace handles how marks (like vowel signs or dots) attach to base consonants.\n\n* **View Modes:** Toggle between **By Rule** (logical groups), **By Base**, or **By Mark**.\n* **Class Synchronization:** Characters are often grouped into **Attachment Classes**. Positioning a mark on a 'Class Representative' (marked with a crown) will automatically propagate that position to all 'Siblings' in the class. \n* **Unlinking:** If a specific combination needs a unique position that differs from its class, click the **Broken Link** icon in the editor to break the sync.\n* **Manage Rules:** Use the **Manage Rules** menu to define your own classes, glyph groups, and manual anchor points.",
  "helpKerningTitle": "Kerning (Spacing)",
  "helpKerningContent": "Kerning adjusts the horizontal gap between specific pairs of letters for visual balance.\n\n* **Auto-Kern:** Use the **Sparkles** icon to let the engine calculate optical spacing automatically based on the glyph shapes.\n* **X-Distance:** In the editor, hover over the gap to see the 'x-dist' line. This represents the closest distance between glyphs in their middle zone. Input a target value to snap the spacing precisely.",
  "helpCreatorTitle": "Creator Studio",
  "helpCreatorContent": "Use the purple **Create** button to turn your font into artwork or stickers.\n\n* **Layouts:** Presets for Square (Social Posts), Portrait (Stories), and Landscape.\n* **Customization:** Drag text directly on the canvas to position it. Add background images, adjust shadows, and use the 'Dimmer' overlay for better readability.\n* **Export:** Download your creation as a high-resolution PNG.",
  "helpSettingsTitle": "Settings & Version History",
  "helpSettingsContent": "* **Metrics:** Adjust global font properties like UPM, Ascender, and Descender using the visual visualizer.\n* **Guide Font:** Upload a reference font (.ttf) to see its ghost outline in the background while you design.\n* **Snapshots:** The app automatically saves your progress, but you can use **Take Snapshot** in the 'More' menu to manually save a version you can restore to later (Version History).",
  "helpCommandPaletteTitle": "Power User Shortcuts",
  "helpCommandPaletteContent": "Press **Ctrl+K** (or Cmd+K) to open the **Command Palette**. From here, you can search for any glyph, jump between workspaces, or execute actions like 'Export' and 'Save' entirely from your keyboard."
}