
{
  "helpTitle": "Help & Guide",
  "helpQuickStartTitle": "Quick Start: Your First Character",
  "helpQuickStartContent": "Welcome! This short guide will walk you through creating your first character and seeing it in action.\n\n* **1. Select a Script:** From the home screen, choose the script you want to work with (e.g., 'Tamil').\n* **2. Open the Editor:** In the 'Drawing' workspace, you'll see a grid of characters. Click on the first one, 'అ'.\n* **3. Draw Your Character:** The drawing editor will open. The 'Pen' tool is selected by default. Click and drag on the canvas to draw the shape of 'అ'. Don't worry about making it perfect!\n* **4. Save Your Work:** Click the 'Back' button in the top-left corner. If you have 'Autosave' enabled (which is the default), your drawing is saved automatically. If not, you'll be prompted to save.\n* **5. Test Your Font:** Click the 'Test' button (flask icon) in the main header. In the test page, type 'అ' into the input box. You should see your newly drawn character in the preview panel!\n* **6. Keep Going:** Go back to the main screen and continue drawing more characters. The more you draw, the more complete your font will be.\n* **7. Export:** When you're ready, click the 'Export OTF' button. This will generate your font file, which you can then install and use on your computer.",
  "helpWorkflowTitle": "The Font Creation Workflow",
  "helpWorkflowContent": "This application offers two main modes to suit different needs:\n\n- **Simple Mode:** Perfect for beginners, hobbyists, or anyone wanting to create a basic font quickly. It focuses on the essential drawing tools.\n- **Advanced Mode:** Designed for typographers and users who need fine-grained control. It unlocks features like precise curve editing, kerning, positioning, and OpenType rule management.\n\n**Simple Workflow:**\n* **1. Drawing:** Go to the 'Drawing' workspace. Click on each character and draw its shape using the tools provided.\n* **2. Export:** Once you've drawn all the characters you need, click the 'Export OTF' button in the header to get your font file.\n\n**Advanced Workflow:**\n* **1. Drawing:** Same as the simple workflow, but you can use 'Advanced Mode' to fine-tune curves (see 'Glyph Editor' section).\n* **2. Positioning:** Go to the 'Positioning' workspace. Adjust the placement of vowel signs and other marks relative to base characters.\n* **3. Kerning:** Go to the 'Kerning' workspace. Fine-tune the spacing between specific pairs of letters for better readability.\n* **4. Rules:** Go to the 'Rules' workspace. For very complex scripts, you can define your own OpenType substitution rules.\n* **5. Export:** Click 'Export OTF' to generate a font with all your advanced adjustments.",
  "helpDrawingTitle": "Workspace: Drawing (Glyph Editor)",
  "helpDrawingContent": "This is where you bring your characters to life. When you click on a character from the main grid, this editor opens, providing a powerful set of tools to create and refine your glyphs.\n\n**The Toolbar - A Detailed Guide**\n\n**1. Drawing Tools:**\n* **Pen Tool:** Draws smooth, freehand curves. Click and drag to create a path that follows your cursor.\n* **Calligraphy Pen:** Simulates a broad-nib pen. It creates strokes with varying thickness based on the drawing angle, perfect for calligraphic styles. You can change the nib angle in the toolbar.\n* **Line Tool:** Click and drag to draw a perfectly straight line.\n* **Circle & Ellipse Tools:** Click a starting point (center) and drag outwards to define the radius (or radii for an ellipse).\n* **Curve Tool (Quadratic Bézier):** This tool lets you create a simple curve with three clicks: 1. Click to set the start point. 2. Click and drag to set the end point. 3. Move the mouse to shape the curve with the control point, and click a final time to set it.\n* **Dot Tool:** Creates a solid circular dot. The first click sets the center, and dragging defines the radius.\n\n**2. Editing & Selection Tools:**\n* **Select Tool:** This is the most powerful tool for transformations. Click on a stroke to select it, or click and drag a box (marquee) to select multiple strokes. Once selected, a bounding box with handles appears:\n  * **Move:** Click inside the box and drag to move the selection.\n  * **Resize (Scale):** Drag the corner handles to resize proportionally.\n  * **Rotate:** Drag the handle at the top-center of the box to rotate the selection.\n* **Edit Points Tool (Advanced Mode):** This tool gives you precise control over your curves. When you select a path, its underlying structure is revealed:\n  * **Anchor Points (Red circles):** These are the main points that lie *on* the path. You can drag them to change the path's shape. Double-clicking a path segment **between** points adds a new anchor point.\n  * **Control Points (Yellow squares):** These points are connected to anchor points and control the curvature of the line segment. Drag them to adjust the bend of the curve. They act like magnets, pulling the curve towards them.\n  * **Deleting Points:** Select an anchor or control point by clicking on it, then press the 'Delete' or 'Backspace' key to remove it. You can also **double-click (or double-tap) directly on a point** to delete it.\n* **Eraser Tool:** Behaves like a real eraser, removing any part of a stroke it touches. Drag it over your lines to create gaps or erase sections.\n\n**3. Canvas & View Tools:**\n* **Pan Tool:** Allows you to click and drag to move your view across the entire canvas without affecting your drawing.\n* **Zoom In / Zoom Out:** Use these buttons or the scroll wheel on your mouse to get a closer or wider view of your work.\n\n**4. Other Features:**\n* **Image Guide:** Use the 'Import Image' button to load a picture onto the canvas. This is great for tracing sketches or reference material. You can adjust the image's opacity, size, and rotation.\n* **Clipboard:** Use the Cut, Copy, and Paste buttons to duplicate parts of your drawing, even between different glyphs.\n* **Properties (Advanced Mode):** The properties panel lets you set the Left Side Bearing (LSB) and Right Side Bearing (RSB), which control the default spacing around your character.\n* **A Note on Saving:** If 'Autosave' is enabled in Settings, your work on a glyph is automatically saved when you click the 'Back' button or navigate to another glyph. If it's disabled, you will be prompted to save or discard your changes before leaving the editor.\n\n**Importing Vector Graphics (SVG) - Advanced**\nFor users who prefer to design their characters in external vector graphics software like Inkscape, Illustrator, or Figma, you can import your work directly.\n* **How to Import:** Click the 'Import SVG' button in the toolbar and select your `.svg` file.\n* **What Happens:** The application will parse your SVG and convert its paths into native 'outline' paths. It automatically scales and centers the imported glyph within the drawing area.\n* **Light-weight Editing:** Once imported, these vector shapes are fully editable! Switch to **Advanced Mode** and use the **Edit Points Tool** to select the path. You can then move anchor points, adjust Bézier curves, and fine-tune the shape just as if you had drawn it here. This allows for quick adjustments without needing to go back to your original software.\n* **Tip:** For best results, keep your SVGs simple. Use basic paths without complex effects, text objects, or embedded images.",
  "helpPositioningTitle": "Workspace: Positioning",
  "helpPositioningContent": "**What is Positioning?** Positioning (also known as mark attachment) is the process of precisely placing combining characters, like vowel signs (e.g., ி, ீ) or dots (e.g., ்), relative to a base consonant (e.g., க).\n\nThis workspace ensures marks appear correctly relative to their base characters.\n* **How it Works:** The app automatically generates all required combinations based on the script's rules. Your job is to adjust the position of the mark for each pair.\n* **Editing:** Click on any combination card to open the editor. The base character will be shown in grey as a fixed guide. You can only select and move the paths belonging to the mark.\n* **Reusing Positions:** To save time, you can copy the positioning from one character to another. For example, after positioning all marks for 'க', you can use the 'Reuse' button on 'ச' to copy those same relative positions.",
  "helpKerningTitle": "Workspace: Kerning / Spacing",
  "helpKerningContent": "**What is Kerning (or Spacing)?** Kerning (also called Spacing in Simple Mode for some scripts) is the process of adjusting the spacing between specific pairs of letters to improve readability and visual appeal. For example, in English, the space between 'A' and 'V' is often reduced to make them appear closer together.\n\nThis workspace lets you fine-tune the spacing between specific pairs of letters.\n* **Recommended Pairs:** The app provides a list of common pairs that often need spacing adjustments for your chosen script.\n* **Custom Pairs:** You can create your own pairs by selecting characters from the side panels.\n* **Editing:** Click on a pair card. A modal will open showing the two characters side-by-side. Enter a negative value to bring them closer, or a positive value to push them apart. You can also use the 'Auto-kern' button to get a suggested value.\n* **Auto-kerning:** The 'Auto-kern' button in the header will attempt to calculate a reasonable kerning value for all un-kerned pairs currently visible on the page.",
  "helpRulesTitle": "Workspace: Rules (Advanced Mode)",
  "helpRulesContent": "This is the most advanced section, allowing direct manipulation of the OpenType Feature code that governs your font's behavior.\n\n**GUI Editor:**\n* This is the default view. It provides a user-friendly interface for creating common substitution rules without writing code.\n* **Rule Types:** You can create Ligatures (substituting multiple glyphs with one), Contextual rules (substituting a glyph only when it's next to others), and more.\n* **How to Create:** Click 'Add New Rule', select the type, and then drag-and-drop glyphs from the palette on the right into the designated zones.\n\n**FEA Code Editor:**\n* **FEA (Adobe Feature File Syntax)** is the standard language for defining OpenType features.\n* By clicking 'Edit Manually', you can switch to a raw code editor. The app will generate the initial code based on your GUI rules, kerning, and positioning data.\n* **Full Control:** In this mode, you can write any valid FEA code you want. This is for advanced users who need to implement features not covered by the GUI.\n* **Warning:** When in manual FEA mode, the GUI editor is disabled. Your code becomes the single source of truth. You can revert back, but any manual code changes will be lost.",
  "helpExportingTitle": "Exporting & Using Your Font",
  "helpExportingContent": "Once you're happy with your creation, it's time to share it with the world!\n\n**Project File vs. Font File**\nIt's important to understand the two types of files you'll work with:\n* **Project File (.json):** This is your editable work file. Use the 'Save' button to download this file to your computer. Use the 'Load' button to open it again in this application and continue where you left off. **You cannot install this file as a font.**\n* **Font File (.otf):** This is the final, usable font generated by the 'Export OTF' button. This is the file you install on your computer and use in other applications like Word, Photoshop, etc.\n\n**What is an OTF file?**\nOTF (OpenType Font) is a standard font format that works on most modern computers, including Windows, macOS, and Linux.\n\n**How to Install Your Font**\n* **Windows:** Right-click the `.otf` file and select 'Install' or 'Install for all users'.\n* **macOS:** Double-click the `.otf` file. The Font Book application will open. Click the 'Install Font' button.\n\n**Understanding Export Warnings**\nSometimes, you might see a warning when you export. Here's what they mean:\n* **Incomplete Font Warning:** This means you haven't drawn all the characters defined in the script. The font will still work, but any character you haven't drawn will appear as a blank space or a box in other applications.\n* **Feature Compilation Error:** This is an advanced warning. It means there was an error in the OpenType Rules code (the FEA code). Your basic characters will probably work fine, but complex behaviors like ligatures or special mark positioning might be broken. You can still choose to export the font with its basic characters.\n\n**Automatic Glyph Creation**\nThe app is designed to be robust and handle missing information gracefully. It does this in two main ways:\n* **Missing Unicode Values:** If you are creating a custom script and forget to add a `\"unicode\"` value for a character in your `characters.json` file, the app will automatically assign it a unique codepoint from the Private Use Area (PUA) when you load the project. This ensures every character has a stable identifier.\n* **Dynamic Ligatures:** During export, the app checks your OpenType rules. If it finds a rule for a ligature (e.g., a special combination of characters) that you haven't explicitly defined or drawn, it will create it on-the-fly. It assigns the new ligature the next available PUA codepoint and attempts to build its shape by combining its component parts. This ensures that even complex rules can be processed without requiring you to manually create every single combination in the character grid.",
  "helpCompareTitle": "Glyph Comparison (Advanced Mode)",
  "helpCompareContent": "**This is an Advanced Mode feature.**\n\nAccessed from the main header, the Comparison View lets you see multiple characters side-by-side. This is extremely useful for checking for consistency in size, stroke weight, and style across your character set. You can select which characters to view from the sidebar.",
  "helpSettingsTitle": "Settings",
  "helpSettingsContent": "The settings page, accessed from the header, allows you to configure various aspects of the app and your font.\n\n- **General:** Control tool behavior like stroke thickness, change the UI theme, and switch languages.\n- **Font Meta Data:** Edit the information that gets embedded in the final font file, such as the font name, designer, manufacturer, and license.\n- **Test Page:** Customize the default font size and line height for the 'Test' view.\n- **Metrics (Advanced Mode):** This powerful section defines the fundamental vertical measurements for your entire font. It's like setting the ceiling, floor, and main floor level for every character.\n  * **Ascender:** The highest point that any character's shape reaches.\n  * **Descender:** The lowest point that any character's shape dips to (like the tail of 'ழ').\n  * **Units Per Em:** The grid size of your font. A higher number allows for more precision. 1000 or 2048 are common values.\n  * **Base Line Y / Top Line Y:** These control the position of the visual guides on the drawing canvas. Adjusting them doesn't change the font itself, only your drawing environment.",
  "helpSupportedScriptsTitle": "Supported Scripts",
  "helpCustomScriptTitle": "Creating a Custom Script",
  "helpCustomScriptContent": "This feature allows you to use the font editor for any script, provided you supply the necessary configuration files. This is intended for advanced users who are comfortable with JSON and font terminology.\n\n**1. Characters File (.json) - Required**\nThis file defines all the characters in your script. It must be an array of objects. Each object can either be a character set or a rule definition.\n* **Character Set:** An object with a `\"nameKey\"` (for the tab name) and a `\"characters\"` array. Each character needs:\n  * `\"unicode\"`: The decimal Unicode codepoint.\n  * `\"name\"`: The character's name (used for display and in rules).\n  * `\"glyphClass\"`: Can be `\"base\"`, `\"mark\"`, or `\"ligature\"`.\n\n**Attachment Class Definitions (`markAttachmentClass`, `baseAttachmentClass`):**\nThese powerful features allow for automatic pre-filling of positions. For fine-grained control, a class definition can be configured in one of three ways:\n* **1. Universal:** The class applies to all corresponding bases or marks. (e.g., `\"members\": [\"ग\", \"म\", \"भ\"]`)\n* **2. Universal with Exceptions:** The class applies to all bases/marks **except** for a few. Use the `\"exceptions\"` property. (e.g., `\"exceptions\": { \"bases\": [\"र\"] }`)\n* **3. Restricted Application:** The class applies **only** to a specific list of bases/marks. Use the `\"applies\"` property. This is useful when a group of characters only shares positioning behavior for a small subset of marks.\n\n**Example of a restricted `baseAttachmentClass`:**\n```json\n{\n  \"name\": \"Central Stem Consonants\",\n  \"members\": [\"प\", \"फ\"],\n  \"applies\": {\n    \"marks\": [\"ु\", \"ू\", \"ृ\"]\n  }\n}\n```\nIn this example, positioning `पु` will auto-position `फु`, but positioning `पे` will **not** auto-position `फे` because the mark `े` is not in the `applies` list.\n\n\n* **Example `characters.json` snippet:**\n```json\n[\n  {\n    \"nameKey\": \"vowels\",\n    \"characters\": [\n      { \"unicode\": 2949, \"name\": \"అ\", \"glyphClass\": \"base\" },\n      { \"unicode\": 2950, \"name\": \"ఆ\", \"glyphClass\": \"base\" }\n    ]\n  },\n  {\n    \"recommendedKerning\": [[\"A\", \"V\"]]\n  }\n]\n```\n\n**2. Rules File (.json) - Optional**\nThis file defines the basic OpenType substitution rules, like how a consonant and a vowel sign combine into a single ligature.\n\n* **Structure:** It's a JSON object, typically with one top-level key for the script tag (e.g., `\"tml2\"` for Tamil). Inside, you have features like `\"liga\"` (ligatures). The keys are the names of the resulting ligature glyphs, and the values are arrays of the component glyph names.\n\n* **Example `rules.json` snippet:**\n```json\n{\n  \"myscript\": {\n    \"psts\": { // Post-base substitutions\n      \"liga\": {\n        \"k_u\": [\"k\", \"u_sign\"]\n      }\n    }\n  }\n}\n```\n\n**3. FEA File (.fea) - Optional, Overrides JSON Rules**\nFor maximum control, you can provide a complete OpenType Feature file.\n\n* **Priority:** If a `.fea` file is uploaded, **it will be used instead of the `rules.json` file** for generating all OpenType features.\n* **Glyph Naming Convention:** This is **critical**. Inside your FEA code, you **must** refer to glyphs by their Unicode codepoint in the format `uniXXXX`, where `XXXX` is the four-digit hexadecimal representation of the codepoint. For example, the character `అ` (Unicode 2949, which is B85 in hex) must be referred to as `uni0B85` in the FEA code. A rule to substitute 'க' with 'ச' would be written as `sub uni0B85 by uni0B9A;`.\n* **The app uses this naming scheme internally when building the font**, so your FEA code must match it to work correctly."
}