
{
  "helpTitle": "உதவி & வழிகாட்டி",
  "helpQuickStartTitle": "விரைவு தொடக்கம்: உங்கள் முதல் எழுத்து",
  "helpQuickStartContent": "நல்வரவு! இந்த சிறிய வழிகாட்டி உங்கள் முதல் எழுத்தை உருவாக்கி அதைச் செயல்பாட்டில் காண்பிக்கும்.\n\n* **1. எழுத்துமுறையைத் தேர்ந்தெடுக்கவும்:** முகப்புத் திரையில் இருந்து, நீங்கள் பணியாற்ற விரும்பும் எழுத்துமுறையைத் தேர்வுசெய்யவும் (எ.கா., 'தமிழ்').\n* **2. திருத்தியைத் திறக்கவும்:** 'வரைதல்' பணியிடத்தில், எழுத்துக்களின் ஒரு கட்டத்தைக் காண்பீர்கள். முதல் எழுத்தான 'அ' என்பதைக் கிளிக் செய்யவும்.\n* **3. உங்கள் எழுத்தை வரையவும்:** வரைதல் திருத்தி திறக்கும். 'பேனா' கருவி இயல்பாகத் தேர்ந்தெடுக்கப்பட்டிருக்கும். 'அ' வடிவத்தை வரைய கேன்வாஸில் கிளிக் செய்து இழுக்கவும். அதைச் சரியாக வரைய வேண்டும் என்று கவலைப்பட வேண்டாம்!\n* **4. உங்கள் வேலையைச் சேமிக்கவும்:** மேல்-இடது மூலையில் உள்ள 'பின்செல்' பொத்தானைக் கிளிக் செய்யவும். நீங்கள் 'தானியங்கி சேமிப்பு' இயக்கியிருந்தால் (இது இயல்புநிலை), உங்கள் வரைபடம் தானாகவே சேமிக்கப்படும். இல்லையெனில், சேமிக்க அறிவுறுத்தப்படுவீர்கள்.\n* **5. உங்கள் எழுத்துருவைச் சோதிக்கவும்:** பிரதான தலைப்பில் உள்ள 'சோதனை' பொத்தானை (சோதனைக் குடுவை ஐகான்) கிளிக் செய்யவும். சோதனைப் பக்கத்தில், உள்ளீட்டுப் பெட்டியில் 'அ' எனத் தட்டச்சு செய்யவும். உங்கள் புதிதாக வரையப்பட்ட எழுத்தை முன்னோட்டப் பலகத்தில் காண வேண்டும்!\n* **6. தொடரவும்:** பிரதான திரைக்குச் சென்று மேலும் எழுத்துக்களை வரையவும். நீங்கள் எவ்வளவு வரைகிறீர்களோ, அவ்வளவு முழுமையானதாக உங்கள் எழுத்துரு இருக்கும்.\n* **7. ஏற்றுமதி:** நீங்கள் தயாரானதும், 'OTF ஆக ஏற்றுமதி செய்' பொத்தானைக் கிளிக் செய்யவும். இது உங்கள் எழுத்துரு கோப்பை உருவாக்கும், அதை நீங்கள் உங்கள் கணினியில் நிறுவிப் பயன்படுத்தலாம்.",
  "helpWorkflowTitle": "எழுத்துரு உருவாக்கும் வழிமுறை",
  "helpWorkflowContent": "இந்தச் செயலி வெவ்வேறு தேவைகளுக்கு ஏற்ப இரண்டு முக்கிய முறைகளை வழங்குகிறது:\n\n- **எளிய முறை:** ஆரம்பநிலையாளர்கள், பொழுதுபோக்காளர்கள் அல்லது விரைவாக ஒரு அடிப்படை எழுத்துருவை உருவாக்க விரும்பும் எவருக்கும் ஏற்றது. இது அத்தியாவசிய வரைதல் கருவிகளில் கவனம் செலுத்துகிறது.\n- **மேம்பட்ட முறை:** தட்டச்சு வடிவமைப்பாளர்கள் மற்றும் நுண்ணிய கட்டுப்பாடு தேவைப்படும் பயனர்களுக்காக வடிவமைக்கப்பட்டது. இது துல்லியமான வளைவுத் திருத்தம், கெர்னிங், நிலைப்படுத்தல் மற்றும் ஓப்பன்டைப் விதி மேலாண்மை போன்ற அம்சங்களைத் திறக்கிறது.\n\n**எளிய வழிமுறை:**\n* **1. வரைதல்:** 'வரைதல்' பணியிடத்திற்குச் செல்லவும். ഓരോ எழுத்தின் மீதும் கிளிக் செய்து, வழங்கப்பட்ட கருவிகளைப் பயன்படுத்தி அதன் வடிவத்தை வரையவும்.\n* **2. ஏற்றுமதி:** உங்களுக்குத் தேவையான அனைத்து எழுத்துக்களையும் வரைந்தவுடன், உங்கள் எழுத்துரு கோப்பைப் பெற தலைப்பில் உள்ள 'OTF ஆக ஏற்றுமதி செய்' பொத்தானைக் கிளிக் செய்யவும்.\n\n**மேம்பட்ட வழிமுறை:**\n* **1. வரைதல்:** எளிய வழிமுறையைப் போலவே, ஆனால் வளைவுகளைச் செம்மைப்படுத்த 'மேம்பட்ட பயன்முறையை' நீங்கள் பயன்படுத்தலாம் ('கிளிஃப் திருத்தி' பகுதியைப் பார்க்கவும்).\n* **2. நிலைப்படுத்தல்:** 'நிலைப்படுத்தல்' பணியிடத்திற்குச் செல்லவும். உயிரெழுத்துக் குறிகள் மற்றும் பிற குறிகளின் இடத்தை அடிப்படை எழுத்துக்களுடன் ஒப்பிட்டு சரிசெய்யவும்.\n* **3. கெர்னிங்:** 'கெர்னிங்' பணியிடத்திற்குச் செல்லவும். சிறந்த வாசிப்புத்திறனுக்காக குறிப்பிட்ட எழுத்து ஜோடிகளுக்கு இடையிலான இடைவெளியைச் செம்மைப்படுத்தவும்.\n* **4. விதிகள்:** 'விதிகள்' பணியிடத்திற்குச் செல்லவும். மிகவும் சிக்கலான எழுத்துமுறைகளுக்கு, உங்கள் சொந்த ஓப்பன்டைப் பதிலீட்டு விதிகளை நீங்கள் வரையறுக்கலாம்.\n* **5. ஏற்றுமதி:** உங்கள் அனைத்து மேம்பட்ட சரிசெய்தல்களுடன் ஒரு எழுத்துருவை உருவாக்க 'OTF ஆக ஏற்றுமதி செய்' என்பதைக் கிளிக் செய்யவும்.",
  "helpDrawingTitle": "பணியிடம்: வரைதல் (கிளிஃப் திருத்தி)",
  "helpDrawingContent": "இங்குதான் உங்கள் எழுத்துக்களுக்கு உயிர் கொடுக்கிறீர்கள். பிரதான கட்டத்திலிருந்து ஒரு எழுத்தைக் கிளிக் செய்யும்போது, இந்த திருத்தி திறக்கும். இது உங்கள் கிளிஃப்களை உருவாக்கவும் செம்மைப்படுத்தவும் சக்திவாய்ந்த கருவிகளின் தொகுப்பை வழங்குகிறது.\n\n**கருவிப்பட்டி - ஒரு விரிவான வழிகாட்டி**\n\n**1. வரைதல் கருவிகள்:**\n* **பேனா கருவி (Pen Tool):** மென்மையான, தன்னிச்சையான வளைவுகளை வரைகிறது. உங்கள் கர்சரைப் பின்தொடரும் ஒரு பாதையை உருவாக்க கிளிக் செய்து இழுக்கவும்.\n* **எழுத்தாணி கருவி (Calligraphy Pen):** அகலமான முனை கொண்ட பேனாவைப் போல செயல்படுகிறது. இது வரையும் கோணத்தைப் பொறுத்து மாறுபட்ட தடிமன் கொண்ட கோடுகளை உருவாக்குகிறது, இது கைப்பிரதி பாணிகளுக்கு ஏற்றது. கருவிப்பட்டியில் முனை கோணத்தை மாற்றலாம்.\n* **கோடு கருவி (Line Tool):** ஒரு நேர்க்கோட்டை வரைய கிளிக் செய்து இழுக்கவும்.\n* **வட்டம் & நீள்வட்டம் கருவிகள் (Circle & Ellipse Tools):** ஒரு தொடக்கப் புள்ளியை (மையம்) கிளிக் செய்து, ஆரையை (அல்லது நீள்வட்டத்திற்கான ஆரங்களை) வரையறுக்க வெளிப்புறமாக இழுக்கவும்.\n* **வளைவு கருவி (Curve Tool - Quadratic Bézier):** இந்த கருவி மூன்று கிளிக்குகளில் ஒரு எளிய வளைவை உருவாக்க உங்களை அனுமதிக்கிறது: 1. தொடக்கப் புள்ளியை அமைக்க கிளிக் செய்யவும். 2. இறுதிப் புள்ளியை அமைக்க கிளிக் செய்து இழுக்கவும். 3. கட்டுப்பாட்டுப் புள்ளியுடன் வளைவை வடிவமைக்க சுட்டியை நகர்த்தி, அதை அமைக்க இறுதி முறையாக கிளிக் செய்யவும்.\n* **புள்ளி கருவி (Dot Tool):** ஒரு திடமான வட்டப் புள்ளியை உருவாக்குகிறது. முதல் கிளிக் மையத்தை அமைக்கிறது, இழுப்பது ஆரையை வரையறுக்கிறது.\n\n**2. திருத்துதல் & தேர்வு கருவிகள்:**\n* **தேர்வு கருவி (Select Tool):** இது உருமாற்றங்களுக்கான மிகவும் சக்திவாய்ந்த கருவி. ஒரு கோட்டைத் தேர்ந்தெடுக்க அதைக் கிளிக் செய்யவும், அல்லது பல கோடுகளைத் தேர்ந்தெடுக்க ஒரு பெட்டியை (marquee) கிளிக் செய்து இழுக்கவும். தேர்ந்தெடுத்தவுடன், கைப்பிடிகளைக் கொண்ட ஒரு எல்லைப் பெட்டி தோன்றும்:\n  * **நகர்த்து (Move):** தேர்வை நகர்த்த பெட்டியின் உள்ளே கிளிக் செய்து இழுக்கவும்.\n  * **அளவை மாற்று (Resize/Scale):** விகிதாசாரமாக அளவை மாற்ற மூலை கைப்பிடிகளை இழுக்கவும்.\n  * **சுழற்று (Rotate):** தேர்வைச் சுழற்ற பெட்டியின் மேல்-மையத்தில் உள்ள கைப்பிடியை இழுக்கவும்.\n* **புள்ளிகளைத் திருத்து கருவி (Edit Points Tool - மேம்பட்ட பயன்முறை):** இந்த கருவி உங்கள் வளைவுகளின் மீது துல்லியமான கட்டுப்பாட்டை வழங்குகிறது. ஒரு பாதையைத் தேர்ந்தெடுக்கும்போது, அதன் அடிப்படைக் கட்டமைப்பு வெளிப்படும்:\n  * **நங்கூரப் புள்ளிகள் (சிவப்பு வட்டங்கள்):** இவை பாதையின் *மீது* இருக்கும் முக்கிய புள்ளிகள். பாதையின் வடிவத்தை மாற்ற அவற்றை இழுக்கலாம். ஒரு பாதைப் பிரிவில் புள்ளிகளுக்கு **இடையில்** இருமுறை கிளிக் செய்வது ஒரு புதிய நங்கூரப் புள்ளியைச் சேர்க்கும்.\n  * **கட்டுப்பாட்டுப் புள்ளிகள் (மஞ்சள் சதுரங்கள்):** இந்தப் புள்ளிகள் நங்கூரப் புள்ளிகளுடன் இணைக்கப்பட்டு, கோட்டுப் பிரிவின் வளைவைக் கட்டுப்படுத்துகின்றன. வளைவின் வளைவை சரிசெய்ய அவற்றை இழுக்கவும். அவை காந்தங்களைப் போல செயல்பட்டு, வளைவைத் தம்மை நோக்கி இழுக்கின்றன.\n  * **புள்ளிகளை நீக்குதல்:** ஒரு நங்கூரப் புள்ளி அல்லது கட்டுப்பாட்டுப் புள்ளியைக் கிளிக் செய்து தேர்ந்தெடுத்து, அதை அகற்ற 'Delete' அல்லது 'Backspace' விசையை அழுத்தவும். ஒரு புள்ளியை விரைவாக நீக்க, அதன் மீது **இருமுறை கிளிக் (அல்லது இருமுறை தட்டவும்)** செய்யலாம்.\n* **அழிப்பான் கருவி (Eraser Tool):** உங்கள் வரைபடத்தின் பகுதிகளை நீக்குகிறது. இது ஒரு பாதையின் பகுதிகளை அல்லது அவற்றின் கட்டுப்பாட்டுப் புள்ளிகளைக் கிளிக் செய்தால் முழுப் பாதைகளையும் அழிக்க முடியும்.\n\n**3. கேன்வாஸ் & காட்சி கருவிகள்:**\n* **நகர்த்தல் கருவி (Pan Tool):** உங்கள் வரைபடத்தைப் பாதிக்காமல், கேன்வாஸ் முழுவதும் உங்கள் பார்வையை நகர்த்த கிளிக் செய்து இழுக்க உங்களை அனுமதிக்கிறது.\n* **உருப்பெருக்கு / உருச்சிறுக்கு (Zoom In / Zoom Out):** உங்கள் வேலையை நெருக்கமாகவோ அல்லது அகலமாகவோ பார்க்க இந்த பொத்தான்களைப் பயன்படுத்தவும் அல்லது உங்கள் சுட்டியின் உருளையைப் பயன்படுத்தவும்.\n\n**4. பிற அம்சங்கள்:**\n* **பட வழிகாட்டி (Image Guide):** கேன்வாஸில் ஒரு படத்தைப் பதிவேற்ற 'படத்தை இறக்குமதி செய்' பொத்தானைப் பயன்படுத்தவும். இது ஓவியங்கள் அல்லது குறிப்புப் பொருட்களை வரைவதற்கு சிறந்தது. படத்தின் ஒளிபுகுநிலை, அளவு மற்றும் சுழற்சியை நீங்கள் சரிசெய்யலாம்.\n* **கிளிப்போர்டு (Clipboard):** உங்கள் வரைபடத்தின் பகுதிகளை நகலெடுக்க, வெவ்வேறு கிளிஃப்களுக்கு இடையில் கூட, வெட்டு, நகலெடு, ஒட்டு பொத்தான்களைப் பயன்படுத்தவும்.\n* **பண்புகள் (Properties - மேம்பட்ட பயன்முறை):** பண்புகள் குழு உங்கள் எழுத்தைச் சுற்றியுள்ள இயல்புநிலை இடைவெளியைக் கட்டுப்படுத்தும் இடது பக்க தாங்கி (LSB) மற்றும் வலது பக்க தாங்கி (RSB) ஆகியவற்றை அமைக்க உங்களை அனுமதிக்கிறது.\n* **சேமிப்பைப் பற்றிய குறிப்பு:** அமைப்புகளில் 'தானியங்கி சேமிப்பு' இயக்கப்பட்டிருந்தால், ஒரு கிளிஃபில் உங்கள் வேலை 'பின்செல்' பொத்தானைக் கிளிக் செய்யும்போது அல்லது மற்றொரு கிளிஃபிற்குச் செல்லும்போது தானாகவே சேமிக்கப்படும். அது முடக்கப்பட்டிருந்தால், திருத்தியை விட்டு வெளியேறும் முன் உங்கள் மாற்றங்களைச் சேமிக்க அல்லது நிராகரிக்க அறிவுறுத்தப்படுவீர்கள்.\n\n**திசையன் வரைகலை இறக்குமதி (SVG) - மேம்பட்டது**\nஇன்க்ஸ்கேப், இல்லஸ்ட்ரேட்டர் அல்லது ஃபிக்மா போன்ற வெளிப்புற திசையன் வரைகலை மென்பொருளில் தங்கள் எழுத்துக்களை வடிவமைக்க விரும்பும் பயனர்களுக்கு, உங்கள் வேலையை நேரடியாக இறக்குமதி செய்யலாம்.\n* **இறக்குமதி செய்வது எப்படி:** கருவிப்பட்டியில் உள்ள 'SVG இறக்குமதி' பொத்தானைக் கிளிக் செய்து உங்கள் `.svg` கோப்பைத் தேர்ந்தெடுக்கவும்.\n* **என்ன நடக்கும்:** செயலி உங்கள் SVG ஐப் பாகுபடுத்தி அதன் பாதைகளை உள்ளூர் 'வெளிக்கோடு' பாதைகளாக மாற்றும். இது இறக்குமதி செய்யப்பட்ட கிளிஃபை வரைதல் பகுதிக்குள் தானாகவே அளவிட்டு மையப்படுத்தும்.\n* **இலகுவான திருத்தம்:** இறக்குமதி செய்யப்பட்டவுடன், இந்த திசையன் வடிவங்கள் முழுமையாகத் திருத்தக்கூடியவை! **மேம்பட்ட பயன்முறைக்கு** மாறி, பாதையைத் தேர்ந்தெடுக்க **புள்ளிகளைத் திருத்து கருவியைப்** பயன்படுத்தவும். பின்னர் நீங்கள் நங்கூரப் புள்ளிகளை நகர்த்தலாம், பெசியர் வளைவுகளை சரிசெய்யலாம், மற்றும் வடிவத்தை நீங்கள் இங்கேயே வரைந்தது போலவே செம்மைப்படுத்தலாம். இது உங்கள் அசல் மென்பொருளுக்குத் திரும்பிச் செல்லத் தேவையில்லாமல் விரைவான சரிசெய்தல்களை அனுமதிக்கிறது.\n* **குறிப்பு:** சிறந்த முடிவுகளுக்கு, உங்கள் SVGகளை எளிமையாக வைத்திருங்கள். சிக்கலான விளைவுகள், உரைப் பொருள்கள் அல்லது உட்பொதிக்கப்பட்ட படங்கள் இல்லாமல் அடிப்படைப் பாதைகளைப் பயன்படுத்தவும்.",
  "helpPositioningTitle": "பணியிடம்: நிலைப்படுத்தல்",
  "helpPositioningContent": "**நிலைப்படுத்தல் என்றால் என்ன?** நிலைப்படுத்தல் (குறி இணைப்பு என்றும் அழைக்கப்படுகிறது) என்பது உயிரெழுத்துக் குறிகள் (எ.கா., ி, ீ) அல்லது புள்ளிகள் (எ.கா., ்) போன்ற இணைப்புக் குறிகளை ஒரு அடிப்படை மெய்யெழுத்துடன் (எ.கா., க) ஒப்பிட்டு துல்லியமாக வைக்கும் செயல்முறையாகும்.\n\nஇந்தக் பணியிடம் குறிகள் அவற்றின் அடிப்படை எழுத்துக்களுடன் ஒப்பிடும்போது சரியாகத் தோன்றுவதை உறுதி செய்கிறது.\n* **செயல்படும் விதம்:** எழுத்துமுறையின் விதிகளின் அடிப்படையில் தேவையான அனைத்து சேர்க்கைகளையும் செயலி தானாகவே உருவாக்குகிறது. ഓരോ ஜோடிக்கும் குறியின் நிலையை சரிசெய்வது உங்கள் வேலை.\n* **திருத்துதல்:** திருத்தியைத் திறக்க எந்தவொரு சேர்க்கை அட்டையையும் கிளிக் செய்யவும். அடிப்படை எழுத்து ஒரு நிலையான வழிகாட்டியாக சாம்பல் நிறத்தில் காட்டப்படும். நீங்கள் குறியைச் சேர்ந்த பாதைகளை மட்டுமே தேர்ந்தெடுத்து நகர்த்த முடியும்.\n* **நிலைகளைப் மீண்டும் பயன்படுத்துதல்:** நேரத்தை மிச்சப்படுத்த, ஒரு எழுத்திலிருந்து மற்றொரு எழுத்திற்கு நிலைப்படுத்தலை நீங்கள் நகலெடுக்கலாம். எடுத்துக்காட்டாக, 'க' க்கான அனைத்து குறிகளையும் நிலைப்படுத்திய பிறகு, 'ச' இல் உள்ள 'மீண்டும் பயன்படுத்து' பொத்தானைப் பயன்படுத்தி அதே சார்பு நிலைகளை நகலெடுக்கலாம்.",
  "helpKerningTitle": "பணியிடம்: கெர்னிங் / இடைவெளி",
  "helpKerningContent": "**கெர்னிங் (அல்லது இடைவெளி) என்றால் என்ன?** கெர்னிங் (எளிய பயன்முறையில் இடைவெளி என்றும் அழைக்கப்படுகிறது) என்பது வாசிப்புத்திறன் மற்றும் காட்சி முறையீட்டை மேம்படுத்துவதற்காக குறிப்பிட்ட எழுத்து ஜோடிகளுக்கு இடையிலான இடைவெளியை சரிசெய்யும் செயல்முறையாகும். எடுத்துக்காட்டாக, ஆங்கிலத்தில், 'A' மற்றும் 'V' க்கு இடையிலான இடைவெளி அவை நெருக்கமாகத் தோன்றுவதற்காகக் குறைக்கப்படுகிறது.\n\nஇந்த பணியிடம் குறிப்பிட்ட எழுத்து ஜோடிகளுக்கு இடையிலான இடைவெளியைச் செம்மைப்படுத்த உங்களை அனுமதிக்கிறது.\n* **பரிந்துரைக்கப்பட்ட ஜோடிகள்:** செயலி நீங்கள் தேர்ந்தெடுத்த எழுத்துமுறைக்கு பெரும்பாலும் கெர்னிங் தேவைப்படும் பொதுவான ஜோடிகளின் பட்டியலை வழங்குகிறது.\n* **தனிப்பயன் ஜோடிகள்:** பக்க பேனல்களிலிருந்து எழுத்துக்களைத் தேர்ந்தெடுப்பதன் மூலம் உங்கள் சொந்த ஜோடிகளை உருவாக்கலாம்.\n* **திருத்துதல்:** ஒரு ஜோடி அட்டையைக் கிளிக் செய்யவும். ஒரு மாதிரி சாளரம் இரு எழுத்துக்களையும் அருகருகே காட்டும். அவற்றை நெருக்கமாகக் கொண்டுவர ஒரு எதிர்மறை மதிப்பை உள்ளிடவும், அல்லது அவற்றை விலக்க ஒரு நேர்மறை மதிப்பை உள்ளிடவும். பரிந்துரைக்கப்பட்ட மதிப்பைப் பெற 'தானியங்கி-கெர்ன்' பொத்தானையும் பயன்படுத்தலாம்.\n* **தானியங்கி-கெர்னிங்:** தலைப்பில் உள்ள 'தானியங்கி-கெர்ன்' பொத்தான் பக்கத்தில் தற்போது தெரியும் அனைத்து கெர்ன் செய்யப்படாத ஜோடிகளுக்கும் ஒரு நியாயமான கெர்னிங் மதிப்பைக் கணக்கிட முயற்சிக்கும்.",
  "helpRulesTitle": "பணியிடம்: விதிகள் (மேம்பட்ட பயன்முறை)",
  "helpRulesContent": "இது மிகவும் மேம்பட்ட பகுதியாகும், இது உங்கள் எழுத்துருவின் நடத்தையை நிர்வகிக்கும் ஓப்பன்டைப் அம்சக் குறியீட்டை நேரடியாகக் கையாள அனுமதிக்கிறது.\n\n**வரைகலை பயனர் இடைமுக திருத்தி (GUI Editor):**\n* இது இயல்புநிலைக் காட்சியாகும். இது குறியீடு எழுதாமல் பொதுவான பதிலீட்டு விதிகளை உருவாக்க ஒரு பயனர் நட்பு இடைமுகத்தை வழங்குகிறது.\n* **விதி வகைகள்:** நீங்கள் கூட்டெழுத்துக்கள் (பல கிளிஃப்களை ஒன்றுடன் மாற்றுதல்), சூழல்சார் விதிகள் (ஒரு கிளிஃப் மற்றவற்றுக்கு அருகில் இருக்கும்போது மட்டும் மாற்றுதல்), மற்றும் பலவற்றை உருவாக்கலாம்.\n* **உருவாக்குவது எப்படி:** 'புதிய விதியைச் சேர்' என்பதைக் கிளிக் செய்து, வகையைத் தேர்ந்தெடுத்து, பின்னர் வலதுபுறத்தில் உள்ள தட்டுகளிலிருந்து கிளிஃப்களை நியமிக்கப்பட்ட மண்டலங்களுக்கு இழுத்து விடவும்.\n\n**FEA குறியீடு திருத்தி (FEA Code Editor):**\n* **FEA (அடோப் அம்சக் கோப்பு தொடரியல்)** என்பது ஓப்பன்டைப் அம்சங்களை வரையறுப்பதற்கான நிலையான மொழியாகும்.\n* 'கையால் திருத்து' என்பதைக் கிளிக் செய்வதன் மூலம், நீங்கள் ஒரு மூலக் குறியீடு திருத்திக்கு மாறலாம். செயலி உங்கள் GUI விதிகள், கெர்னிங் மற்றும் நிலைப்படுத்தல் தரவுகளின் அடிப்படையில் ஆரம்பக் குறியீட்டை உருவாக்கும்.\n* **முழுமையான கட்டுப்பாடு:** இந்த பயன்முறையில், நீங்கள் விரும்பும் எந்தவொரு செல்லுபடியாகும் FEA குறியீட்டையும் எழுதலாம். இது GUI ஆல் உள்ளடக்கப்படாத அம்சங்களைச் செயல்படுத்த வேண்டிய மேம்பட்ட பயனர்களுக்கானது.\n* **எச்சரிக்கை:** கைமுறை FEA பயன்முறையில் இருக்கும்போது, GUI திருத்தி முடக்கப்பட்டுள்ளது. உங்கள் குறியீடு மட்டுமே உண்மையின் ஒரே ஆதாரமாகிறது. நீங்கள் மீண்டும் திரும்பலாம், ஆனால் எந்த கைமுறை குறியீடு மாற்றങ്ങളും இழக்கப்படும்.",
  "helpExportingTitle": "உங்கள் எழுத்துருவை ஏற்றுமதி செய்தல் & பயன்படுத்துதல்",
  "helpExportingContent": "உங்கள் படைப்பில் நீங்கள் மகிழ்ச்சியாக இருந்தால், அதை உலகத்துடன் பகிர்ந்து கொள்ள வேண்டிய நேரம் இது!\n\n**திட்டக் கோப்பு மற்றும் எழுத்துரு கோப்பு**\nநீங்கள் பணிபுரியும் இரண்டு வகையான கோப்புகளைப் புரிந்துகொள்வது முக்கியம்:\n* **திட்டக் கோப்பு (.json):** இது உங்கள் திருத்தக்கூடிய வேலைக் கோப்பு. இந்த கோப்பை உங்கள் கணினிக்கு பதிவிறக்கம் செய்ய 'சேமி' பொத்தானைப் பயன்படுத்தவும். இந்த பயன்பாட்டில் மீண்டும் திறந்து நீங்கள் விட்ட இடத்திலிருந்து தொடர 'ஏற்று' பொத்தானைப் பயன்படுத்தவும். **இந்த கோப்பை எழுத்துருவாக நிறுவ முடியாது.**\n* **எழுத்துரு கோப்பு (.otf):** இது 'OTF ஆக ஏற்றுமதி செய்' பொத்தானால் உருவாக்கப்பட்ட இறுதி, பயன்படுத்தக்கூடிய எழுத்துருவாகும். இது உங்கள் கணினியில் நிறுவி, வேர்ட், போட்டோஷாப் போன்ற பிற பயன்பாடுகளில் பயன்படுத்தும் கோப்பு.\n\n**OTF கோப்பு என்றால் என்ன?**\nOTF (OpenType Font) என்பது விண்டோஸ், மேக்ஓஎஸ் மற்றும் லினக்ஸ் உள்ளிட்ட பெரும்பாலான நவீன கணினிகளில் செயல்படும் ஒரு நிலையான எழுத்துரு வடிவமாகும்.\n\n**உங்கள் எழுத்துருவை நிறுவுவது எப்படி**\n* **விண்டோஸ்:** `.otf` கோப்பில் வலது கிளிக் செய்து 'Install' அல்லது 'Install for all users' என்பதைத் தேர்ந்தெடுக்கவும்.\n* **மேக்ஓஎஸ்:** `.otf` கோப்பை இருமுறை கிளிக் செய்யவும். Font Book பயன்பாடு திறக்கும். 'Install Font' பொத்தானைக் கிளிக் செய்யவும்.\n\n**ஏற்றுமதி எச்சரிக்கைகளைப் புரிந்துகொள்ளுதல்**\nசில நேரங்களில், நீங்கள் ஏற்றுமதி செய்யும்போது ஒரு எச்சரிக்கையைக் காணலாம். அவற்றின் அர்த்தம் இங்கே:\n* **முழுமையற்ற எழுத்துரு எச்சரிக்கை:** இது எழுத்துமுறையில் வரையறுக்கப்பட்ட அனைத்து எழுத்துக்களையும் நீங்கள் வரையவில்லை என்று அர்த்தம். எழுத்துரு இன்னும் வேலை செய்யும், ஆனால் நீங்கள் வரையாத எந்த எழுத்தும் பிற பயன்பாடுகளில் வெற்று இடமாக அல்லது ஒரு பெட்டியாகத் தோன்றும்.\n* **அம்சத் தொகுப்புப் பிழை:** இது ஒரு மேம்பட்ட எச்சரிக்கை. ஓப்பன்டைப் விதிகள் குறியீட்டில் (FEA குறியீடு) ஒரு பிழை இருந்தது என்று அர்த்தம். உங்கள் அடிப்படை எழுத்துக்கள் அநேகமாக நன்றாக வேலை செய்யும், ஆனால் கூட்டெழுத்துக்கள் அல்லது சிறப்பு குறி நிலைப்படுத்தல் போன்ற சிக்கலான நடத்தைகள் உடைந்திருக்கலாம். நீங்கள் இன்னும் அதன் அடிப்படை எழுத்துக்களுடன் எழுத்துருவை ஏற்றுமதி செய்யத் தேர்வுசெய்யலாம்.\n\n**தானியங்கி கிளிஃப் உருவாக்கம்**\nவிடுபட்ட தகவல்களை நேர்த்தியாகக் கையாளும் வகையில் இந்த செயலி வடிவமைக்கப்பட்டுள்ளது. இது இரண்டு முக்கிய வழிகளில் செயல்படுகிறது:\n* **விடுபட்ட யூனிகோட் மதிப்புகள்:** நீங்கள் ஒரு தனிப்பயன் எழுத்துமுறையை உருவாக்கும்போது, உங்கள் `characters.json` கோப்பில் ஒரு எழுத்திற்கு `\"unicode\"` மதிப்பைச் சேர்க்க மறந்துவிட்டால், திட்டத்தை ஏற்றும்போது செயலி தானாகவே தனியார் பயன்பாட்டுப் பகுதியிலிருந்து (PUA) ஒரு தனித்துவமான குறியீட்டு எண்ணை அதற்கு ஒதுக்கும். இது ஒவ்வொரு எழுத்திற்கும் ஒரு நிலையான அடையாளங்காட்டி இருப்பதை உறுதி செய்கிறது.\n* **இயங்குறு கூட்டெழுத்துக்கள்:** ஏற்றுமதி செய்யும் போது, செயலி உங்கள் ஓப்பன்டைப் விதிகளைச் சரிபார்க்கும். நீங்கள் வரையறுக்காத அல்லது வரையாத ஒரு கூட்டெழுத்திற்கான (எ.கா., எழுத்துக்களின் சிறப்புச் சேர்க்கை) விதியைக் கண்டால், அதை உடனடியாக உருவாக்கும். இது புதிய கூட்டெழுத்திற்கு அடுத்ததாகக் கிடைக்கும் PUA குறியீட்டு எண்ணை ஒதுக்கி, அதன் கூறு பாகங்களை இணைத்து அதன் வடிவத்தை உருவாக்க முயற்சிக்கும். இது சிக்கலான விதிகளைக் கூட, நீங்கள் ஒவ்வொரு சேர்க்கையையும் எழுத்துக் கட்டத்தில் கைமுறையாக உருவாக்கத் தேவையில்லாமல் செயல்படுத்த முடியும் என்பதை உறுதி செய்கிறது.",
  "helpCompareTitle": "கிளிஃப் ஒப்பீடு (மேம்பட்ட முறை)",
  "helpCompareContent": "**இது ஒரு மேம்பட்ட முறை அம்சமாகும்.**\n\nபிரதான தலைப்பிலிருந்து அணுகக்கூடிய ஒப்பீட்டுக் காட்சி, பல எழுத்துக்களை அருகருகே பார்க்க உங்களை அனுமதிக்கிறது. உங்கள் எழுத்துத் தொகுப்பு முழுவதும் அளவு, கோட்டின் எடை மற்றும் பாணியில் நிலைத்தன்மையைச் சரிபார்க்க இது மிகவும் பயனுள்ளதாக இருக்கும். பக்கப்பட்டியிலிருந்து எந்த எழுத்துக்களைக் காணலாம் என்பதை நீங்கள் தேர்ந்தெடுக்கலாம்.",
  "helpSettingsTitle": "அமைப்புகள்",
  "helpSettingsContent": "தலைப்பிலிருந்து அணுகக்கூடிய அமைப்புகள் பக்கம், செயலி மற்றும் உங்கள் எழுத்துருவின் பல்வேறு அம்சங்களை உள்ளமைக்க உங்களை அனுமதிக்கிறது.\n\n- **பொது:** கோட்டின் தடிமன் போன்ற கருவி நடத்தையைக் கட்டுப்படுத்தவும், பயனர் இடைமுக தீம் மாற்றவும், மற்றும் மொழிகளை மாற்றவும்.\n- **எழுத்துரு மெட்டா தரவு:** எழுத்துரு பெயர், வடிவமைப்பாளர், உற்பத்தியாளர் மற்றும் உரிமம் போன்ற இறுதி எழுத்துரு கோப்பில் உட்பொதிக்கப்பட்ட தகவல்களைத் திருத்தவும்.\n- **சோதனைப் பக்கம்:** 'சோதனை' காட்சிக்கான இயல்புநிலை எழுத்துரு அளவு மற்றும் வரி உயரத்தைத் தனிப்பயனாக்கவும்.\n- **அளவீடுகள் (மேம்பட்ட பயன்முறை):** இந்த சக்திவாய்ந்த பிரிவு உங்கள் முழு எழுத்துருவிற்கும் அடிப்படை செங்குத்து அளவீடுகளை வரையறுக்கிறது. இது प्रत्येक எழுத்திற்கும் உச்சவரம்பு, தரை மற்றும் முக்கிய தரை மட்டத்தை அமைப்பது போன்றது.\n  * **ஏற்றம் (Ascender):** எந்தவொரு எழுத்தின் வடிவமும் அடையும் மிக உயர்ந்த புள்ளி.\n  * **இறக்கம் (Descender):** எந்தவொரு எழுத்தின் வடிவமும் தாழும் மிகக் குறைந்த புள்ளி ('ழ' வின் வால் போல).\n  * **ஒரு Em-க்கான அலகுகள் (Units Per Em):** உங்கள் எழுத்துருவின் கட்ட அளவு. அதிக எண் அதிக துல்லியத்தை அனுமதிக்கிறது. 1000 அல்லது 2048 பொதுவான மதிப்புகள்.\n  * **அடிக் கோடு Y / மேல் கோடு Y:** இவை வரைதல் கேன்வாஸில் உள்ள காட்சி வழிகாட்டிகளின் நிலையை கட்டுப்படுத்துகின்றன. அவற்றை சரிசெய்வது எழுத்துருவையே மாற்றாது, உங்கள் வரைதல் சூழலை மட்டுமே மாற்றும்.",
  "helpSupportedScriptsTitle": "ஆதரிக்கப்படும் எழுத்துமுறைகள்",
  "helpCustomScriptTitle": "தனிப்பயன் எழுத்துமுறையை உருவாக்குதல்",
  "helpCustomScriptContent": "தேவையான உள்ளமைவு கோப்புகளை நீங்கள் வழங்கினால், எந்தவொரு எழுத்துமுறைக்கும் எழுத்துரு திருத்தியைப் பயன்படுத்த இந்த அம்சம் உங்களை அனுமதிக்கிறது. இது JSON மற்றும் எழுத்துரு சொற்களஞ்சியத்துடன் வசதியாக இருக்கும் மேம்பட்ட பயனர்களுக்காக வடிவமைக்கப்பட்டுள்ளது.\n\n**1. எழுத்துக்கள் கோப்பு (.json) - தேவை**\nஇந்தக் கோப்பு உங்கள் எழுத்துமுறையில் உள்ள அனைத்து எழுத்துக்களையும் வரையறுக்கிறது. இது பொருள்களின் ஒரு வரிசையாக இருக்க வேண்டும். ஒவ்வொரு பொருளும் ஒரு எழுத்துத் தொகுப்பு அல்லது ஒரு விதி வரையறையாக இருக்கலாம்.\n* **எழுத்துத் தொகுப்பு:** ஒரு `\"nameKey\"` (தத்தல் பெயருக்கு) மற்றும் ஒரு `\"characters\"` வரிசையுடன் கூடிய ஒரு பொருள். ഓരോ எழுத்திற்கும் தேவை:\n  * `\"unicode\"`: தசம யூனிகோட் குறியீட்டு எண்.\n  * `\"name\"`: எழுத்தின் பெயர் (காட்சி மற்றும் விதிகளில் பயன்படுத்தப்படுகிறது).\n  * `\"glyphClass\"`: `\"base\"`, `\"mark\"`, அல்லது `\"ligature\"` ஆக இருக்கலாம்.\n\n* **எடுத்துக்காட்டு `characters.json` துணுக்கு:**\n```json\n[\n  {\n    \"nameKey\": \"vowels\",\n    \"characters\": [\n      { \"unicode\": 2949, \"name\": \"அ\", \"glyphClass\": \"base\" },\n      { \"unicode\": 2950, \"name\": \"ஆ\", \"glyphClass\": \"base\" }\n    ]\n  },\n  {\n    \"recommendedKerning\": [[\"A\", \"V\"]]\n  }\n]\n```\n\n**2. விதிகள் கோப்பு (.json) - விருப்பத்தேர்வு**\nஇந்தக் கோப்பு அடிப்படை ஓப்பன்டைப் பதிலீட்டு விதிகளை வரையறுக்கிறது, ஒரு மெய்யெழுத்து மற்றும் ஒரு உயிரெழுத்துக் குறி ஒரு ஒற்றை கூட்டெழுத்தாக எப்படி இணைகிறது போன்றவை.\n\n* **கட்டமைப்பு:** இது ஒரு JSON பொருள், பொதுவாக எழுத்துமுறை குறிக்கு ஒரு மேல்-நிலை விசை (எ.கா., தமிழுக்கு `\"tml2\"`). உள்ளே, `\"liga\"` (கூட்டெழுத்துக்கள்) போன்ற அம்சங்கள் உள்ளன. விசைகள் விளைவாக வரும் கூட்டெழுத்து கிளிஃப்களின் பெயர்கள், மற்றும் மதிப்புகள் கூறு கிளிஃப் பெயர்களின் வரிசைகள்.\n\n* **எடுத்துக்காட்டு `rules.json` துணுக்கு:**\n```json\n{\n  \"myscript\": {\n    \"psts\": { // அடிப்படைக்குப் பிந்தைய பதிலீடுகள்\n      \"liga\": {\n        \"k_u\": [\"k\", \"u_sign\"]\n      }\n    }\n  }\n}\n```\n\n**3. FEA கோப்பு (.fea) - விருப்பத்தேர்வு, JSON விதிகளை மீறுகிறது**\nஅதிகபட்ச கட்டுப்பாட்டிற்கு, நீங்கள் ஒரு முழுமையான ஓப்பன்டைப் அம்சக் கோப்பை வழங்கலாம்.\n\n* **முன்னுரிமை:** ஒரு `.fea` கோப்பு பதிவேற்றப்பட்டால், **அது `rules.json` கோப்பிற்குப் பதிலாக அனைத்து ஓப்பன்டைப் அம்சங்களையும் உருவாக்கப் பயன்படுத்தப்படும்**.\n* **கிளிஃப் பெயரிடல் மரபு:** இது **மிக முக்கியமானது**. உங்கள் FEA குறியீட்டிற்குள், நீங்கள் கிளிஃப்களை அவற்றின் யூனிகோட் குறியீட்டு எண்ணின் வடிவத்தில் `uniXXXX` என்று குறிப்பிட வேண்டும், இங்கு `XXXX` என்பது குறியீட்டு எண்ணின் நான்கு இலக்க ஹெக்ஸாடெசிமல் பிரதிநிதித்துவமாகும். எடுத்துக்காட்டாக, `அ` (யூனிகோட் 2949, இது ஹெக்ஸில் B85) என்ற எழுத்தை FEA குறியீட்டில் `uni0B85` என்று குறிப்பிட வேண்டும். 'க' வை 'ச' உடன் மாற்றும் ஒரு விதி `sub uni0B85 by uni0B9A;` என எழுதப்படும்.\n* **செயலி எழுத்துருவை உருவாக்கும்போது இந்த பெயரிடல் திட்டத்தை உள்நாட்டில் பயன்படுத்துகிறது**, எனவே உங்கள் FEA குறியீடு சரியாக வேலை செய்ய அதனுடன் பொருந்த வேண்டும்."
}